espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/kit/common/drivers/mx25flash_spi.c
/*
 * COPYRIGHT (c) 2010-2015 MACRONIX INTERNATIONAL CO., LTD
 * SPI Flash Low Level Driver (LLD) Sample Code
 *
 * SPI interface command set
 *
 * $Id: MX25_CMD.c,v 1.31 2015/03/24 01:06:33 mxclldb1 Exp $
 */

#include "mx25flash_spi.h"
#include "em_gpio.h"
#include "em_usart.h"
#include "em_cmu.h"

/* If the USART for the MX25 driver is not defined, these functions are unavailable */
#ifdef MX25_USART

/* Fallback to loc 11 if no location is defined for backwards compatibility */
#ifndef MX25_LOC_RX
#define MX25_LOC_RX            _USART_ROUTELOC0_RXLOC_LOC11
#endif
#ifndef MX25_LOC_SCLK
#define MX25_LOC_SCLK          _USART_ROUTELOC0_CLKLOC_LOC11
#endif
#ifndef MX25_LOC_TX
#define MX25_LOC_TX            _USART_ROUTELOC0_TXLOC_LOC11
#endif
/* Fallback to baudrate of 8 MHz if not defined for backwards compatibility */
#ifndef MX25_BAUDRATE
#define MX25_BAUDRATE   8000000
#endif

/* Local functions */

/* Basic functions */
void CS_High( void );
void CS_Low( void );
void InsertDummyCycle( uint8_t dummy_cycle );
void SendByte( uint8_t byte_value, uint8_t transfer_type );
uint8_t GetByte( uint8_t transfer_type );

/* Utility functions */
void Wait_Flash_WarmUp( void );
void Initial_Spi( void );
bool WaitFlashReady( uint32_t ExpectTime );
bool WaitRYBYReady( uint32_t ExpectTime );
bool IsFlashBusy( void );
bool IsFlashQIO( void );
bool IsFlash4Byte( void );
void SendFlashAddr( uint32_t flash_address, uint8_t io_mode, bool addr_4byte_mode );
uint8_t GetDummyCycle( uint32_t default_cycle );


void MX25_init( void )
{
   USART_InitSync_TypeDef init = USART_INITSYNC_DEFAULT;

   CMU_ClockEnable( cmuClock_GPIO, true );
   CMU_ClockEnable( MX25_USART_CLK, true );

   init.msbf     = true;
   init.baudrate = MX25_BAUDRATE;
   USART_InitSync( MX25_USART, &init );

   /* IO config */
   GPIO_PinModeSet( MX25_PORT_MOSI, MX25_PIN_MOSI, gpioModePushPull, 1 );
   GPIO_PinModeSet( MX25_PORT_MISO, MX25_PIN_MISO, gpioModeInput,    0 );
   GPIO_PinModeSet( MX25_PORT_SCLK, MX25_PIN_SCLK, gpioModePushPull, 1 );
   GPIO_PinModeSet( MX25_PORT_CS,   MX25_PIN_CS,   gpioModePushPull, 1 );

#ifdef _GPIO_USART_ROUTEEN_MASK
   MX25_USART_ROUTE.CLKROUTE  = ( (MX25_PORT_SCLK << _GPIO_USART_CLKROUTE_PORT_SHIFT)
                                | (MX25_PIN_SCLK  << _GPIO_USART_CLKROUTE_PIN_SHIFT) );
   MX25_USART_ROUTE.RXROUTE   = ( (MX25_PORT_MISO << _GPIO_USART_RXROUTE_PORT_SHIFT)
                                | (MX25_PIN_MISO  << _GPIO_USART_RXROUTE_PIN_SHIFT) );
   MX25_USART_ROUTE.TXROUTE   = ( (MX25_PORT_MOSI << _GPIO_USART_TXROUTE_PORT_SHIFT)
                                | (MX25_PIN_MOSI  << _GPIO_USART_TXROUTE_PIN_SHIFT) );
   MX25_USART_ROUTE.ROUTEEN   = (  GPIO_USART_ROUTEEN_RXPEN
                                | GPIO_USART_ROUTEEN_TXPEN
                                | GPIO_USART_ROUTEEN_CLKPEN );
#else
   MX25_USART->ROUTELOC0 = ( (MX25_LOC_RX << _USART_ROUTELOC0_RXLOC_SHIFT)
                           | (MX25_LOC_TX << _USART_ROUTELOC0_TXLOC_SHIFT)
                           | (MX25_LOC_SCLK << _USART_ROUTELOC0_CLKLOC_SHIFT) );
   MX25_USART->ROUTEPEN  = (  USART_ROUTEPEN_RXPEN
                            | USART_ROUTEPEN_TXPEN
                            | USART_ROUTEPEN_CLKPEN );

#endif
   /* Wait for flash warm-up */
   Initial_Spi();
}

void MX25_deinit( void )
{
  GPIO_PinModeSet( MX25_PORT_MOSI, MX25_PIN_MOSI, gpioModeDisabled, 0);
  GPIO_PinModeSet( MX25_PORT_MISO, MX25_PIN_MISO, gpioModeDisabled, 0);
  GPIO_PinModeSet( MX25_PORT_SCLK, MX25_PIN_SCLK, gpioModeDisabled, 1);
  GPIO_PinModeSet( MX25_PORT_CS,   MX25_PIN_CS,   gpioModeDisabled, 1);

  USART_Reset(MX25_USART);

#ifdef _GPIO_USART_ROUTEEN_MASK
  MX25_USART_ROUTE.CLKROUTE = _GPIO_USART_CLKROUTE_RESETVALUE;
  MX25_USART_ROUTE.RXROUTE  = _GPIO_USART_RXROUTE_RESETVALUE;
  MX25_USART_ROUTE.TXROUTE  = _GPIO_USART_TXROUTE_RESETVALUE;
  MX25_USART_ROUTE.ROUTEEN  = _GPIO_USART_ROUTEEN_RESETVALUE;
#else
  MX25_USART->ROUTELOC0 = _USART_ROUTELOC0_RESETVALUE;
  MX25_USART->ROUTEPEN  = _USART_ROUTEPEN_RESETVALUE;
#endif

  CMU_ClockEnable( MX25_USART_CLK, false );
}

/*
 --Common functions
 */

/*
 * Function:       Wait_Flash_WarmUp
 * Arguments:      None.
 * Description:    Wait some time until flash read / write enable.
 * Return Message: None.
 */
void Wait_Flash_WarmUp()
{
    volatile int time_cnt = FlashFullAccessTime;
    while( time_cnt > 0 )
    {
        time_cnt--;
    }
}

/*
 * Function:       Initial_Spi
 * Arguments:      None
 * Description:    Initial spi flash state and wait flash warm-up
 *                 (enable read/write).
 * Return Message: None
 */
void Initial_Spi()
{
   // Wait flash warm-up
   Wait_Flash_WarmUp();
}

/*
 * Function:       CS_Low, CS_High
 * Arguments:      None.
 * Description:    Chip select go low / high.
 * Return Message: None.
 */
void CS_Low()
{
   GPIO_PinOutClear( MX25_PORT_CS, MX25_PIN_CS );
}

void CS_High()
{
   GPIO_PinOutSet( MX25_PORT_CS, MX25_PIN_CS );
}

/*
 * Function:       InsertDummyCycle
 * Arguments:      dummy_cycle, number of dummy clock cycle
 * Description:    Insert dummy cycle of SCLK
 * Return Message: None.
 */
void InsertDummyCycle( uint8_t dummy_cycle )
{
   int i;

   for( i = 0; i < dummy_cycle/8; i++ )
   {
      USART_SpiTransfer( MX25_USART, 0xff );
   }
}

/*
 * Function:       SendByte
 * Arguments:      byte_value, data transfer to flash
 *                 transfer_type, select different type of I/O mode.
 *                 Seven mode:
 *                 SIO, single IO
 *                 DIO, dual IO
 *                 QIO, quad IO
 *                 PIO, parallel
 *                 DTSIO, double transfer rate SIO
 *                 DTDIO, double transfer rate DIO
 *                 DTQIO, double transfer rate QIO
 * Description:    Send one byte data to flash
 * Return Message: None.
 */
void SendByte( uint8_t byte_value, uint8_t transfer_type )
{
   switch( transfer_type )
   {
#ifdef SIO
   case SIO: // Single I/O
      USART_SpiTransfer( MX25_USART, byte_value );
      break;
#endif
#ifdef DIO
   case DIO: // Dual I/O
      //--- IO mode not supported! ---//
      break;
#endif
#ifdef QIO
   case QIO: // Quad I/O
      //--- IO mode not supported! ---//
      break;
#endif
#ifdef PIO
    case PIO: // Parallel I/O
       //--- IO mode not supported! ---//
       break;
#endif
#ifdef DTSIO
   case DTSIO: // Double transfer rate Single I/O
      //--- IO mode not supported! ---//
      break;
#endif
#ifdef DTDIO
   case DTDIO: // Double transfer rate Dual I/O
      //--- IO mode not supported! ---//
      break;
#endif
#ifdef DTQIO
   case DTQIO: // Double transfer rate Quad I/O
      //--- IO mode not supported! ---//
      break;
#endif
   default:
      break;
   }
}


